Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: The color with which to draw the display segments and decimal point when they are on.
ru_ru: Цвет, используемый для отображения сегментов и десятичной точки, когда они включены.

source: Selects how many columns are in the matrix, which may range from 1 up to 32.
ru_ru: Определяет, сколько столбцов в матрице, может быть в диапазоне от 1 до 32.

source: Beta 1 for XOR/Odd/Even; 2.0 Beta 6 for XNOR
ru_ru: Beta 1 для Исключающее ИЛИ/Нечётность/Чётность; 2.0 Beta 6 для Исключающее ИЛИ-НЕ

source: Deriving from the example code in this section of the User's Guide does not incur such restrictions; these examples are released under the MIT license.
ru_ru: Разработанное на основе кода примеров этого раздела Руководства пользователя не подвергается таким ограничениям; эти примеры выпущены под лицензией MIT.

source: S-R Flip-Flop
ru_ru: S-R триггер

source: When you select Export Image..., Logisim displays a dialog box with four options.
ru_ru: Когда вы выбираете Экспортировать изображение..., Logisim отображает диалоговое окно с четырьмя настройками.

source: Plexers: More complex combinational components, like multiplexers and decoders.
ru_ru: Плексоры: более сложные комбинационные компоненты, такие как мультиплексоры и декодеры.

source: Clock input: This is absent when the Data Interface attribute's value is "One asynchronous load/store port." In other circumstances, when ld is 0, and this input rises from 0 to 1 (and sel is 1/undefined and clr is 0), then the value at the currently selected address changes to whatever value is at the D pin.
ru_ru: Тактовый вход: отсутствует, если значение атрибута Интерфейс данных - "Один асинхронный порт чтения/записи". В других случаях, когда на входе ld 0, и значение на нём меняется с 0 на 1 (и ещё на входе sel 1/неопределённость и на входе clr 0), значение по выбранному в данный момент адресу меняется на значение на контакте D.

source: If it is not attached to any components, the wire will be drawn gray to indicate that its bit width is unknown; if the components at the locations that the wire helps to connect disagree on the bit width, then the wire will be drawn orange to indicate the conflict, and the wire will in fact refuse to carry any values at all until the user resolves the conflict.
ru_ru: Если он не присоединён к какому-либо компоненту, то провод будет отрисован серым, чтобы показать, что его разрядность неизвестна; если разрядность компонентов, которые провод соединяет, не согласована, то провод будет отрисован оранжевым, чтобы указать на конфликт, и провод не будет передавать какие-либо значения совсем, пока пользователь не разрешит конфликт.

source: Simple: The number of times that component appears directly within the viewed circuit.
ru_ru: Непосредственно: сколько раз компонент непосредственно встречается в рассматриваемой схеме.

source: Hides the initial Logisim splash screen.
ru_ru: Скрывает стартовое окно заставки Logisim.

source: If this box is unchecked, then the default will be not to add wires during a move — though you can turn it on temporarily by pressing the shift key during the move.
ru_ru: Если этот флажок отключен, то по умолчанию при перемещении провода не будут добавляться - но вы можете включить это временно нажатием клавиши Shift при перемещении.

source: Only one Combinational Analysis window exists within Logisim, no matter how many projects are open.
ru_ru: Только одно окно Комбинационный анализ существует в Logisim, независимо от того, сколько проектов открыто.

source: Lowest-order 1
ru_ru: Младший 1

source: Lowest-order 0
ru_ru: Младший 0

source: By contrast, the GNU General Public License is intended to guarantee your freedom to share and change free software--to make sure the software is free for all its users.
ru_ru: Напротив, Универсальная Общественная Лицензия GNU предназначена гарантировать вашу свободу совместно использовать и изменять свободное ПО, т.е. удостоверить, что ПО является свободным для всех его пользователей.

source: Illustrates the essential components of any component type using a simple example of a component that takes a multibit input and computes the next Gray code value following it.
ru_ru: Иллюстрирует важнейшие элементы любого типа компонентов, используя простой пример компонента, который принимает многобитное значение на входе и вычисляет следующее после него значение кода Грея.

source: Specifies the value to which a floating value should be pulled.
ru_ru: Определяет значение, на которое будет изменяться плавающее значение.

source: One of the two values to add.
ru_ru: Одно из двух значений для сложения.

source: Gray Code Counter
ru_ru: Счётчик кода Грея

source: Thus, even though we changed the toolbar's AND tool to create narrow AND gates, the AND tool in the Gates library will still create wide AND gates unless you change its attributes too.
ru_ru: Таким образом, хотя мы изменили инструмент Элемент И на панели инструментов для создания узких элементов И, инструмент Элемент И в библиотеке Элементы по-прежнему создаёт широкие элементы И, пока вы не измените и его атрибуты тоже.

source: Allows the label associated with the tunnel to be edited.
ru_ru: Позволяет редактировать привязанную к тоннелю метку.

source: If, however, an error value or a floating value is encountered during this descent, then all outputs will match that error or floating value.
ru_ru: Однако, если в ходе этого спуска встретится значение ошибки или плавающее, то на всех выходах будет значение ошибки или плавающее.

source: Delete: Removes the component from the circuit.
ru_ru: Удалить: удалить компонент из схемы.

source: Next: Oscillation errors.
ru_ru: Далее: Ошибки при возбуждении.

source: West edge (input, bit width from Bit Width In attribute)
ru_ru: Западный край (вход, разрядность соответствует атрибуту Разрядность входа)

source: In such case, this License incorporates the limitation as if written in the body of this License.
ru_ru: В этом случае данная Лицензия включает в себя это ограничение, как если бы оно было написано в тексте данной Лицензии.

source: * that it works with, and so we'll have an attribute.
ru_ru: * с которой он работает, так что у нас будет атрибут.

source: (Incidentally, some authorities spell this demultiplexor, but demultiplexer is the predominant spelling.)
ru_ru: (Кстати, на английском некоторые специалисты пишут demultiplexor, но demultiplexer является преобладающим написанием.)

source: If Sign, the additional bits are taken to match the highest-order bit in the input.
ru_ru: Если Знак, то дополнительные биты соответствуют самому старшему биту на входе.

source: This is only relevant for languages that use characters outside the 7-bit ASCII character set; this would include languages using accented characters, and it would not include English.
ru_ru: Это имеет смысл только для языков, которые используют символы вне 7-битного набора символов ASCII; сюда относятся языки, использующие специфичные символы; английский сюда не входит.

source: The side of the component where its input/output pin should be.
ru_ru: Сторона компонента, где должен быть его входной/выходной контакт.

source: The bit width of these values can be anything; exactly which bit width is automatically inferred from the components to which the wires are ultimately attached.
ru_ru: Разрядность этих значений может быть любой; какой конкретно - определяется компонентами, к которым провод присоединён.

source: In the below, the output pin's Data Bits attribute has been changed to 1, and so Logisim complains that the wire cannot connect a three-bit value to a one-bit value.
ru_ru: Ниже атрибут Биты данных выходного контакта изменён на 1, так что Logisim жалуется, что провод не может соединить трёхбитное значение с однобитным.

source: // location).
ru_ru: // метки).

source: Shift: When 1 or disconnected, all stages advance with the clock trigger; but if it is 0, no advance takes place.
ru_ru: Сдвиг: когда на нём 1 или он не подключен, все ступени сдвигаются при срабатывании тактового входа; но если на нём 0, никакого сдвига не происходит.

source: To select which component's attributes you wish to view, click the component using the Edit tool ().
ru_ru: Для выбора атрибутов компонента, которые вы хотите просмотреть, щёлкните на компоненте с помощью Инструмента Правка ().

source: notice that there is no warranty (or else, saying that you provide
ru_ru: уведомление о том, что гарантий нет (или, наоборот, сообщающее о том, что вы обеспечиваете

source: West edge, lower pin marked by triangle (input, bit width 1)
ru_ru: Западный край, нижний контакт, отмечен треугольником (вход, разрядность равна 1)

source: To edit the address displayed, click outside the display rectangle.
ru_ru: Чтобы изменить отображаемый адрес, щёлкните за пределами прямоугольника со значениями.

source: Data - the 7-bit ASCII code for the leftmost character in the buffer, or 0 if the buffer is empty.
ru_ru: Данные - 7-битный ASCII код для левого символа в буфере, или 0, если буфер пуст.

source: Logisim's propagation algorithm is more than sophisticated enough for almost all educational purposes; but it is not sophisticated enough for industrial circuit design.
ru_ru: Алгоритм просчёта Logisim более чем достаточно сложен почти для всех образовательных целей; но он не достаточно сложен для промышленной разработки схем.

source: Because the shaped style tends to be more popular in the U.S., while the rectangular style tends to be more popular in Europe, some people refer to these styles according to these regions; but the region-neutral terms shaped and rectangular are preferred.
ru_ru: Поскольку стиль с формой, как правило, более популярен в США, а прямоугольный стиль более популярен в Европе, некоторые люди обозначают стили в соответствии с этими регионами; нейтральные по отношению к регионам термины фигурные и прямоугольные - предпочтительнее.

source: The component determines how many 1 bits are in its input(s) and emits the total number of 1 bits on its output.
ru_ru: Компонент определяет, сколько битов 1 присутствует на его входе (входах) и выдаёт общее количество битов 1 на свой выход.

source: Text
ru_ru: Текст

source: Technically,
ru_ru: Технически,

source: Because we have two output pins corresponding to the two inputs a and b into the two-bit adder, these outputs are included as the first two columns of the output.
ru_ru: Поскольку у нас есть два выходных контакта, соответствующих входам a и b двухбитного сумматора, эти выходы включены как первые два столбца.

source: Arithmetic Library
ru_ru: Библиотека Арифметика

source: // Anywhere in the main rectangle initiates the poke.
ru_ru: // В любом месте главного прямоугольника инициирует нажатие.

source: To add new inputs, type it in the field at the pane's bottom, and click Add.
ru_ru: Чтобы добавить новый вход, введите его в поле внизу вкладки, и нажмите кнопку Добавить.

source: The Combinational Analysis module of Logisim allows you to convert between these three representations in all directions.
ru_ru: Модуль Logisim Комбинационный анализ позволяет вам конвертировать данные между этими тремя представлениями во всех направлениях.

source: /** Returns the current value emitted by the counter.
ru_ru: /** Возвращает текущее значение, выдаваемое счётчиком.

source: (This input format may seem unintuitive, but LED matrixes are sold commercially with exactly this interface.
ru_ru: (Такой формат входа может показаться неинтуитивным, но выпускаемые промышленно светодиодные матрицы имеют в точности такой интерфейс.

source: A transmission gate has three inputs, called source, n-gate, and p-gate; and it has one output, called drain.
ru_ru: У передаточного вентиля три входа, называемые исток, n-затвор, и p-затвор; и один выход, называемый сток.

source: Printer View: Whether to use "printer view" in printing the circuits.
ru_ru: Вид для печати: следует ли использовать "вид для печати" при печати схем.

source: This allows wired-or and wired-and connections, as illustrated below: At left, the buffers' Output Value attribute is floating/1 and the resistor pulls to 0, giving wired-or behavior; at right, the buffers' Output Value attribute is 0/floating and the resistor pulls to 1, giving wired-and behavior.
ru_ru: Это позволяет создавать соединения "монтажное ИЛИ" и "монтажное И", как показано ниже: слева у буферов значение атрибута Выходное значение - "плавающее/1", а направление согласования резистора - ноль, в итоге схема ведёт себя как монтажное ИЛИ; справа у буферов значение атрибута Выходное значение - "0/плавающее", а направление согласования резистора - единица, в итоге схема ведёт себя как монтажное И.

source: The first (leftmost) is a list of all components in the circuit whose values can be logged.
ru_ru: Первая (крайняя слева) представляет собой список всех компонентов схемы, значения которых могут быть записаны в журнал.

source: When the mouse is over a wiring point for an existing component, or if it is atop a current wire, the Edit Tool will display a small green circle around the mouse's location.
ru_ru: Если мышь находится над точкой подключения провода существующего компонента, или над проводом, то Инструмент Правка отобразит маленький зеленый кружок вокруг места расположения курсора.
